Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS00/include/pic32cm1216ls00100.h
#define AUX0_SIZE                      _UL_(0x00000100)    /*    0kB Memory segment type: fuses */
#define AUX0_PAGE_SIZE                 _UL_(        64)
#define AUX0_NB_OF_PAGES               _UL_(         4)

#define AUX1_SIZE                      _UL_(0x00000100)    /*    0kB Memory segment type: fuses */
#define AUX1_PAGE_SIZE                 _UL_(        64)
#define AUX1_NB_OF_PAGES               _UL_(         4)

#define AUX2_SIZE                      _UL_(0x00000100)    /*    0kB Memory segment type: fuses */
#define AUX2_PAGE_SIZE                 _UL_(        64)
#define AUX2_NB_OF_PAGES               _UL_(         4)

#define AUX3_SIZE                      _UL_(0x00000100)    /*    0kB Memory segment type: fuses */
#define AUX3_PAGE_SIZE                 _UL_(        64)
#define AUX3_NB_OF_PAGES               _UL_(         4)

#define AUX4_SIZE                      _UL_(0x00000100)    /*    0kB Memory segment type: fuses */
#define AUX4_PAGE_SIZE                 _UL_(        64)
#define AUX4_NB_OF_PAGES               _UL_(         4)

#define AUX5_SIZE                      _UL_(0x00000100)    /*    0kB Memory segment type: fuses */
#define AUX5_PAGE_SIZE                 _UL_(        64)
#define AUX5_NB_OF_PAGES               _UL_(         4)

#define BOCOR_SIZE                     _UL_(0x00000100)    /*    0kB Memory segment type: fuses */
#define BOCOR_PAGE_SIZE                _UL_(        64)
#define BOCOR_NB_OF_PAGES              _UL_(         4)

#define BOCOR1_SIZE                    _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define CAL_SIZE                       _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define DATAFLASH_SIZE                 _UL_(0x00004000)    /*   16kB Memory segment type: flash */
#define DATAFLASH_PAGE_SIZE            _UL_(        64)
#define DATAFLASH_NB_OF_PAGES          _UL_(       256)

#define LOCKROW_SIZE                   _UL_(0x00000004)    /*    0kB Memory segment type: fuses */
#define OTP1_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP2_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP3_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP4_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define ROM_SIZE                       _UL_(0x00010000)    /*   64kB Memory segment type: fuses */
#define ROM_PAGE_SIZE                  _UL_(        64)
#define ROM_NB_OF_PAGES                _UL_(      1024)

#define SHADOW_SIZE                    _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define SW_CALIB_SIZE                  _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define TLATCH_SIZE                    _UL_(0x00010000)    /*   64kB Memory segment type: fuses */
#define TLATCH_PAGE_SIZE               _UL_(        64)
#define TLATCH_NB_OF_PAGES             _UL_(      1024)

#define USER_PAGE_SIZE                 _UL_(0x00000100)    /*    0kB Memory segment type: user_page */
#define USER_PAGE_PAGE_SIZE            _UL_(        64)
#define USER_PAGE_NB_OF_PAGES          _UL_(         4)

#define HSRAM_SIZE                     _UL_(0x00004000)    /*   16kB Memory segment type: ram */
#define APBA_SIZE                      _UL_(0x00008000)    /*   32kB Memory segment type: io */
#define APBB_SIZE                      _UL_(0x00010000)    /*   64kB Memory segment type: io */
#define APBC_SIZE                      _UL_(0x00006000)    /*   24kB Memory segment type: io */
#define PPB_SIZE                       _UL_(0x00100000)    /* 1024kB Memory segment type: io */

#define FLASH_ADDR                     _UL_(0x00000000)    /**< FLASH base address (type: flash)*/
#define AUX0_ADDR                      _UL_(0x00804000)    /**< AUX0 base address (type: fuses)*/
#define AUX1_ADDR                      _UL_(0x00806000)    /**< AUX1 base address (type: fuses)*/
#define AUX2_ADDR                      _UL_(0x00808000)    /**< AUX2 base address (type: fuses)*/
#define AUX3_ADDR                      _UL_(0x0080a000)    /**< AUX3 base address (type: fuses)*/
#define AUX4_ADDR                      _UL_(0x0080c000)    /**< AUX4 base address (type: fuses)*/
#define AUX5_ADDR                      _UL_(0x0080e000)    /**< AUX5 base address (type: fuses)*/
#define BOCOR_ADDR                     _UL_(0x0080c000)    /**< BOCOR base address (type: fuses)*/
#define BOCOR1_ADDR                    _UL_(0x0080c008)    /**< BOCOR1 base address (type: fuses)*/
#define CAL_ADDR                       _UL_(0x00800000)    /**< CAL base address (type: fuses)*/
#define DATAFLASH_ADDR                 _UL_(0x00400000)    /**< DATAFLASH base address (type: flash)*/
#define LOCKROW_ADDR                   _UL_(0x00802000)    /**< LOCKROW base address (type: fuses)*/
#define OTP1_ADDR                      _UL_(0x00806000)    /**< OTP1 base address (type: fuses)*/
#define OTP2_ADDR                      _UL_(0x00806008)    /**< OTP2 base address (type: fuses)*/
#define OTP3_ADDR                      _UL_(0x00806010)    /**< OTP3 base address (type: fuses)*/
#define OTP4_ADDR                      _UL_(0x00806018)    /**< OTP4 base address (type: fuses)*/
#define ROM_ADDR                       _UL_(0x00830000)    /**< ROM base address (type: fuses)*/
#define SHADOW_ADDR                    _UL_(0x00820000)    /**< SHADOW base address (type: fuses)*/
#define SW_CALIB_ADDR                  _UL_(0x00806020)    /**< SW_CALIB base address (type: fuses)*/
#define TLATCH_ADDR                    _UL_(0x00810000)    /**< TLATCH base address (type: fuses)*/
#define USER_PAGE_ADDR                 _UL_(0x00804000)    /**< USER_PAGE base address (type: user_page)*/
#define HSRAM_ADDR                     _UL_(0x20000000)    /**< HSRAM base address (type: ram)*/
#define APBA_ADDR                      _UL_(0x40000000)    /**< APBA base address (type: io)*/
#define APBB_ADDR                      _UL_(0x41000000)    /**< APBB base address (type: io)*/
#define APBC_ADDR                      _UL_(0x42000000)    /**< APBC base address (type: io)*/
#define PPB_ADDR                       _UL_(0xe0000000)    /**< PPB base address (type: io)*/

/* ************************************************************************** */
/**  DEVICE SIGNATURES FOR PIC32CM1216LS00100                                 */
/* ************************************************************************** */
#define CHIP_DSU_DID                   _UL_(0X20860008)

/* ************************************************************************** */
/**  ELECTRICAL DEFINITIONS FOR PIC32CM1216LS00100                            */
/* ************************************************************************** */

/* ************************************************************************** */
/** Event Generator IDs for C32CM1216LS00100 */
/* ************************************************************************** */
#define EVENT_ID_GEN_OSCCTRL_XOSC_FAIL                    1 /**< ID for OSCCTRL event generator XOSC_FAIL */
#define EVENT_ID_GEN_OSC32KCTRL_XOSC32K_FAIL              2 /**< ID for OSC32KCTRL event generator XOSC32K_FAIL */
#define EVENT_ID_GEN_SUPC_BOD33DET                        3 /**< ID for SUPC event generator BOD33DET */
#define EVENT_ID_GEN_RTC_PER_0                            4 /**< ID for RTC event generator PER_0 */
#define EVENT_ID_GEN_RTC_PER_1                            5 /**< ID for RTC event generator PER_1 */
#define EVENT_ID_GEN_RTC_PER_2                            6 /**< ID for RTC event generator PER_2 */
#define EVENT_ID_GEN_RTC_PER_3                            7 /**< ID for RTC event generator PER_3 */
#define EVENT_ID_GEN_RTC_PER_4                            8 /**< ID for RTC event generator PER_4 */
#define EVENT_ID_GEN_RTC_PER_5                            9 /**< ID for RTC event generator PER_5 */
#define EVENT_ID_GEN_RTC_PER_6                           10 /**< ID for RTC event generator PER_6 */
#define EVENT_ID_GEN_RTC_PER_7                           11 /**< ID for RTC event generator PER_7 */
#define EVENT_ID_GEN_RTC_CMP_0                           12 /**< ID for RTC event generator CMP_0 */
#define EVENT_ID_GEN_RTC_CMP_1                           13 /**< ID for RTC event generator CMP_1 */
#define EVENT_ID_GEN_RTC_TAMPER                          14 /**< ID for RTC event generator TAMPER */
#define EVENT_ID_GEN_RTC_OVF                             15 /**< ID for RTC event generator OVF */
#define EVENT_ID_GEN_RTC_PERD                            16 /**< ID for RTC event generator PERD */
#define EVENT_ID_GEN_EIC_EXTINT_0                        17 /**< ID for EIC event generator EXTINT_0 */
#define EVENT_ID_GEN_EIC_EXTINT_1                        18 /**< ID for EIC event generator EXTINT_1 */
#define EVENT_ID_GEN_EIC_EXTINT_2                        19 /**< ID for EIC event generator EXTINT_2 */
#define EVENT_ID_GEN_EIC_EXTINT_3                        20 /**< ID for EIC event generator EXTINT_3 */
#define EVENT_ID_GEN_EIC_EXTINT_4                        21 /**< ID for EIC event generator EXTINT_4 */
#define EVENT_ID_GEN_EIC_EXTINT_5                        22 /**< ID for EIC event generator EXTINT_5 */
#define EVENT_ID_GEN_EIC_EXTINT_6                        23 /**< ID for EIC event generator EXTINT_6 */
#define EVENT_ID_GEN_EIC_EXTINT_7                        24 /**< ID for EIC event generator EXTINT_7 */
#define EVENT_ID_GEN_EIC_EXTINT_8                        25 /**< ID for EIC event generator EXTINT_8 */
#define EVENT_ID_GEN_EIC_EXTINT_9                        26 /**< ID for EIC event generator EXTINT_9 */
#define EVENT_ID_GEN_EIC_EXTINT_10                       27 /**< ID for EIC event generator EXTINT_10 */
#define EVENT_ID_GEN_EIC_EXTINT_11                       28 /**< ID for EIC event generator EXTINT_11 */
#define EVENT_ID_GEN_EIC_EXTINT_12                       29 /**< ID for EIC event generator EXTINT_12 */
#define EVENT_ID_GEN_EIC_EXTINT_13                       30 /**< ID for EIC event generator EXTINT_13 */
#define EVENT_ID_GEN_EIC_EXTINT_14                       31 /**< ID for EIC event generator EXTINT_14 */
#define EVENT_ID_GEN_EIC_EXTINT_15                       32 /**< ID for EIC event generator EXTINT_15 */
#define EVENT_ID_GEN_DMAC_CH_0                           33 /**< ID for DMAC event generator CH_0 */
#define EVENT_ID_GEN_DMAC_CH_1                           34 /**< ID for DMAC event generator CH_1 */
#define EVENT_ID_GEN_DMAC_CH_2                           35 /**< ID for DMAC event generator CH_2 */
#define EVENT_ID_GEN_DMAC_CH_3                           36 /**< ID for DMAC event generator CH_3 */
#define EVENT_ID_GEN_DMAC_CH_4                           37 /**< ID for DMAC event generator CH_4 */
#define EVENT_ID_GEN_DMAC_CH_5                           38 /**< ID for DMAC event generator CH_5 */
#define EVENT_ID_GEN_DMAC_CH_6                           39 /**< ID for DMAC event generator CH_6 */
#define EVENT_ID_GEN_DMAC_CH_7                           40 /**< ID for DMAC event generator CH_7 */
#define EVENT_ID_GEN_TC0_OVF                             41 /**< ID for TC0 event generator OVF */
#define EVENT_ID_GEN_TC0_MC_0                            42 /**< ID for TC0 event generator MC_0 */
#define EVENT_ID_GEN_TC0_MC_1                            43 /**< ID for TC0 event generator MC_1 */
#define EVENT_ID_GEN_TC1_OVF                             44 /**< ID for TC1 event generator OVF */
#define EVENT_ID_GEN_TC1_MC_0                            45 /**< ID for TC1 event generator MC_0 */
#define EVENT_ID_GEN_TC1_MC_1                            46 /**< ID for TC1 event generator MC_1 */
#define EVENT_ID_GEN_TC2_OVF                             47 /**< ID for TC2 event generator OVF */
#define EVENT_ID_GEN_TC2_MC_0                            48 /**< ID for TC2 event generator MC_0 */
#define EVENT_ID_GEN_TC2_MC_1                            49 /**< ID for TC2 event generator MC_1 */
#define EVENT_ID_GEN_TCC0_TRG                            50 /**< ID for TCC0 event generator TRG */
#define EVENT_ID_GEN_TCC0_CNT                            51 /**< ID for TCC0 event generator CNT */
#define EVENT_ID_GEN_TCC0_MC_0                           52 /**< ID for TCC0 event generator MC_0 */
#define EVENT_ID_GEN_TCC0_MC_1                           53 /**< ID for TCC0 event generator MC_1 */
#define EVENT_ID_GEN_TCC0_MC_2                           54 /**< ID for TCC0 event generator MC_2 */
#define EVENT_ID_GEN_TCC0_MC_3                           55 /**< ID for TCC0 event generator MC_3 */
#define EVENT_ID_GEN_TCC0_OVF                            56 /**< ID for TCC0 event generator OVF */
#define EVENT_ID_GEN_TCC1_TRG                            57 /**< ID for TCC1 event generator TRG */
#define EVENT_ID_GEN_TCC1_CNT                            58 /**< ID for TCC1 event generator CNT */
#define EVENT_ID_GEN_TCC1_MC_0                           59 /**< ID for TCC1 event generator MC_0 */
#define EVENT_ID_GEN_TCC1_MC_1                           60 /**< ID for TCC1 event generator MC_1 */
#define EVENT_ID_GEN_TCC1_OVF                            61 /**< ID for TCC1 event generator OVF */
#define EVENT_ID_GEN_TCC2_TRG                            62 /**< ID for TCC2 event generator TRG */
#define EVENT_ID_GEN_TCC2_CNT                            63 /**< ID for TCC2 event generator CNT */
#define EVENT_ID_GEN_TCC2_MC_0                           64 /**< ID for TCC2 event generator MC_0 */
#define EVENT_ID_GEN_TCC2_MC_1                           65 /**< ID for TCC2 event generator MC_1 */
#define EVENT_ID_GEN_TCC2_OVF                            66 /**< ID for TCC2 event generator OVF */
#define EVENT_ID_GEN_TCC3_TRG                            67 /**< ID for TCC3 event generator TRG */
#define EVENT_ID_GEN_TCC3_CNT                            68 /**< ID for TCC3 event generator CNT */
#define EVENT_ID_GEN_TCC3_MC_0                           69 /**< ID for TCC3 event generator MC_0 */
#define EVENT_ID_GEN_TCC3_MC_1                           70 /**< ID for TCC3 event generator MC_1 */
#define EVENT_ID_GEN_TCC3_MC_2                           71 /**< ID for TCC3 event generator MC_2 */
#define EVENT_ID_GEN_TCC3_MC_3                           72 /**< ID for TCC3 event generator MC_3 */
#define EVENT_ID_GEN_TCC3_OVF                            73 /**< ID for TCC3 event generator OVF */
#define EVENT_ID_GEN_ADC_RESRDY                          74 /**< ID for ADC event generator RESRDY */
#define EVENT_ID_GEN_ADC_WINMON                          75 /**< ID for ADC event generator WINMON */
#define EVENT_ID_GEN_AC_COMP_0                           76 /**< ID for AC event generator COMP_0 */
#define EVENT_ID_GEN_AC_COMP_1                           77 /**< ID for AC event generator COMP_1 */
#define EVENT_ID_GEN_AC_COMP_2                           78 /**< ID for AC event generator COMP_2 */
#define EVENT_ID_GEN_AC_COMP_3                           79 /**< ID for AC event generator COMP_3 */
#define EVENT_ID_GEN_AC_WIN_0                            80 /**< ID for AC event generator WIN_0 */
#define EVENT_ID_GEN_AC_WIN_1                            81 /**< ID for AC event generator WIN_1 */
#define EVENT_ID_GEN_DAC_EMPTY_0                         82 /**< ID for DAC event generator EMPTY_0 */
#define EVENT_ID_GEN_DAC_EMPTY_1                         83 /**< ID for DAC event generator EMPTY_1 */
#define EVENT_ID_GEN_PTC_EOC                             84 /**< ID for PTC event generator EOC */
#define EVENT_ID_GEN_PTC_WCOMP                           85 /**< ID for PTC event generator WCOMP */
#define EVENT_ID_GEN_TRNG_READY                          86 /**< ID for TRNG event generator READY */
#define EVENT_ID_GEN_CCL_LUTOUT_0                        87 /**< ID for CCL event generator LUTOUT_0 */
#define EVENT_ID_GEN_CCL_LUTOUT_1                        88 /**< ID for CCL event generator LUTOUT_1 */
#define EVENT_ID_GEN_CCL_LUTOUT_2                        89 /**< ID for CCL event generator LUTOUT_2 */
#define EVENT_ID_GEN_CCL_LUTOUT_3                        90 /**< ID for CCL event generator LUTOUT_3 */
#define EVENT_ID_GEN_PAC_ACCERR                          91 /**< ID for PAC event generator ACCERR */

/* ************************************************************************** */
/** Event User IDs for C32CM1216LS00100 */
/* ************************************************************************** */
#define EVENT_ID_USER_OSCCTRL_TUNE                        0 /**< ID for OSCCTRL event user TUNE */
#define EVENT_ID_USER_RTC_TAMPER                          1 /**< ID for RTC event user TAMPER */
#define EVENT_ID_USER_NVMCTRL_PAGEW                       2 /**< ID for NVMCTRL event user PAGEW */
#define EVENT_ID_USER_PORT_EV_0                           3 /**< ID for PORT event user EV_0 */
#define EVENT_ID_USER_PORT_EV_1                           4 /**< ID for PORT event user EV_1 */
#define EVENT_ID_USER_PORT_EV_2                           5 /**< ID for PORT event user EV_2 */
#define EVENT_ID_USER_PORT_EV_3                           6 /**< ID for PORT event user EV_3 */
#define EVENT_ID_USER_DMAC_CH_0                           7 /**< ID for DMAC event user CH_0 */
#define EVENT_ID_USER_DMAC_CH_1                           8 /**< ID for DMAC event user CH_1 */
#define EVENT_ID_USER_DMAC_CH_2                           9 /**< ID for DMAC event user CH_2 */
#define EVENT_ID_USER_DMAC_CH_3                          10 /**< ID for DMAC event user CH_3 */
#define EVENT_ID_USER_DMAC_CH_4                          11 /**< ID for DMAC event user CH_4 */
#define EVENT_ID_USER_DMAC_CH_5                          12 /**< ID for DMAC event user CH_5 */
#define EVENT_ID_USER_DMAC_CH_6                          13 /**< ID for DMAC event user CH_6 */
#define EVENT_ID_USER_DMAC_CH_7                          14 /**< ID for DMAC event user CH_7 */
#define EVENT_ID_USER_TC0_EVU                            15 /**< ID for TC0 event user EVU */
#define EVENT_ID_USER_TC1_EVU                            16 /**< ID for TC1 event user EVU */
#define EVENT_ID_USER_TC2_EVU                            17 /**< ID for TC2 event user EVU */
#define EVENT_ID_USER_TCC0_EV_0                          18 /**< ID for TCC0 event user EV_0 */
#define EVENT_ID_USER_TCC0_EV_1                          19 /**< ID for TCC0 event user EV_1 */
#define EVENT_ID_USER_TCC0_MC_0                          20 /**< ID for TCC0 event user MC_0 */
#define EVENT_ID_USER_TCC0_MC_1                          21 /**< ID for TCC0 event user MC_1 */
#define EVENT_ID_USER_TCC0_MC_2                          22 /**< ID for TCC0 event user MC_2 */
#define EVENT_ID_USER_TCC0_MC_3                          23 /**< ID for TCC0 event user MC_3 */
#define EVENT_ID_USER_TCC1_EV_0                          24 /**< ID for TCC1 event user EV_0 */
#define EVENT_ID_USER_TCC1_EV_1                          25 /**< ID for TCC1 event user EV_1 */
#define EVENT_ID_USER_TCC1_MC_0                          26 /**< ID for TCC1 event user MC_0 */
#define EVENT_ID_USER_TCC1_MC_1                          27 /**< ID for TCC1 event user MC_1 */
#define EVENT_ID_USER_TCC2_EV_0                          28 /**< ID for TCC2 event user EV_0 */
#define EVENT_ID_USER_TCC2_EV_1                          29 /**< ID for TCC2 event user EV_1 */
#define EVENT_ID_USER_TCC2_MC_0                          30 /**< ID for TCC2 event user MC_0 */
#define EVENT_ID_USER_TCC2_MC_1                          31 /**< ID for TCC2 event user MC_1 */
#define EVENT_ID_USER_TCC3_EV_0                          32 /**< ID for TCC3 event user EV_0 */
#define EVENT_ID_USER_TCC3_EV_1                          33 /**< ID for TCC3 event user EV_1 */
#define EVENT_ID_USER_TCC3_MC_0                          34 /**< ID for TCC3 event user MC_0 */
#define EVENT_ID_USER_TCC3_MC_1                          35 /**< ID for TCC3 event user MC_1 */
#define EVENT_ID_USER_TCC3_MC_2                          36 /**< ID for TCC3 event user MC_2 */
#define EVENT_ID_USER_TCC3_MC_3                          37 /**< ID for TCC3 event user MC_3 */
#define EVENT_ID_USER_ADC_START                          38 /**< ID for ADC event user START */
#define EVENT_ID_USER_ADC_SYNC                           39 /**< ID for ADC event user SYNC */
#define EVENT_ID_USER_AC_SOC_0                           40 /**< ID for AC event user SOC_0 */
#define EVENT_ID_USER_AC_SOC_1                           41 /**< ID for AC event user SOC_1 */
#define EVENT_ID_USER_AC_SOC_2                           42 /**< ID for AC event user SOC_2 */
#define EVENT_ID_USER_AC_SOC_3                           43 /**< ID for AC event user SOC_3 */
#define EVENT_ID_USER_DAC_START_0                        44 /**< ID for DAC event user START_0 */
#define EVENT_ID_USER_DAC_START_1                        45 /**< ID for DAC event user START_1 */
#define EVENT_ID_USER_PTC_STCONV                         46 /**< ID for PTC event user STCONV */
#define EVENT_ID_USER_PTC_DSEQR                          47 /**< ID for PTC event user DSEQR */
#define EVENT_ID_USER_CCL_LUTIN_0                        48 /**< ID for CCL event user LUTIN_0 */
#define EVENT_ID_USER_CCL_LUTIN_1                        49 /**< ID for CCL event user LUTIN_1 */
#define EVENT_ID_USER_CCL_LUTIN_2                        50 /**< ID for CCL event user LUTIN_2 */
#define EVENT_ID_USER_CCL_LUTIN_3                        51 /**< ID for CCL event user LUTIN_3 */

#ifdef __cplusplus
}
#endif

/** @}  b'end of PIC32CM1216LS00100 definitions' */


#endif /* _PIC32CM1216LS00100_H_ */

